public class MethodExplain {
    // 키워드() -> 메서드가 아님
    // 이름() -> 이름뒤에 소괄호가 있으면 메서드

    // f(x) = 2x +1
    // x -> 매개변수
    // 저장공간 =  2 * 값 +1;
    // f(1) 이면 리턴값, 물론 리턴값이 있을경우만


    // 리턴타입 메서드명 (매개변수) {
    // 실행할 문장
    // return 리턴값;
    //}

    // void 메서드명 (자료형 매개변수, ....){
    // 실행할 문장
    //}

    // void 메서드명 (){
    // 실행할 문장
    //}

    // 메서드 선언 순서
    // 1. 메서드 명을 생각한다.
    // 2. 매개변수를 생각한다.
    // 3. 실행할 문장과 리턴값을 생각한다.

    // int add(int num, int num2){
    // sout ("덧셈");
    // return num1 + num2 // -> 리던 값이 뭘까? 정수 + 정수 -> 정수
    //}

    // 매서드 주의사항
    // 1. 매개변수가 없는 메서드는 외부에서 값을 전달 받을 수 없다.
    // 2. 리턴값이 있는 메서드는 사용시 전체를 리턴값으로 보자.
    // 3. 메서드 내부에 다른 메서드를 선얼할 수 없다. (단, 사용은 가능하다)
    // 4. 메서드 선언시 매개변수는 저장공간이고, 사용시에는 값을 그 자리 순서에 맞게 넣어준다.
}
